/*Created By Jsir on 2018/4/25*/
'use strict'
const mock = {}
mock.rank_level_2 = {
    code: 1,
    data: [
        {
            rank_name: '80后最喜欢的动漫',
            rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来',
            rank_level: 2,
            data: [
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                }

            ]
        },
        {
            rank_name: '80后最喜欢的动漫',
            rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来',
            rank_level: 2,
            data: [
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                }

            ]
        },
        {
            rank_name: '80后最喜欢的动漫',
            rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来',
            rank_level: 2,
            data: [
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                }

            ]
        },
        {
            rank_name: '80后最喜欢的动漫',
            rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来',
            rank_level: 2,
            data: [
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                }

            ]
        },
        {
            rank_name: '80后最喜欢的动漫',
            rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来',
            rank_level: 2,
            data: [
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                }

            ]
        },
        {
            rank_name: '80后最喜欢的动漫',
            rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来',
            rank_level: 2,
            data: [
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                }

            ]
        },
        {
            rank_name: '80后最喜欢的动漫',
            rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来',
            rank_level: 2,
            data: [
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                }

            ]
        },
        {
            rank_name: '80后最喜欢的动漫',
            rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来',
            rank_level: 2,
            data: [
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                }

            ]
        },
        {
            rank_name: '80后最喜欢的动漫',
            rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来',
            rank_level: 2,
            data: [
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                },
                {
                    rank_name: '全职猎人',
                    rank_desc: '“动漫”这一合称的出现主要是因为日本的动画和漫画产业联系紧密，所以日本动画和漫画在中国传播的过程中，出现了《动漫时代》这样综合了日本动画和漫画咨询的杂志。因此，“动漫”最早主要在日本动漫的爱好者中使用，用来指日本的动画和漫画。但随着中国动画和漫画产业的发展，用来指中国的动画和漫画的场合也多了起来'
                }

            ]
        }

    ]
}
module.exports =  mock